espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/interpan/interpan.c
/***************************************************************************//**
 * @file
 * @brief Generic code related to the receipt and processing of interpan
 * messages.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "app/framework/include/af.h"
#include "app/framework/util/util.h"
#include "interpan.h"

#ifdef UC_BUILD
#include "sl_component_catalog.h"
#if defined(ALLOW_KEY_ESTABLISHMENT)
#if defined(ZCL_TERMINATE_KEY_ESTABLISHMENT_FROM_SERVER_COMMAND_ID)
#define ZCL_TERMINATE_KEY_ESTABLISHMENT_COMMAND_ID ZCL_TERMINATE_KEY_ESTABLISHMENT_FROM_SERVER_COMMAND_ID
#elif defined(ZCL_TERMINATE_KEY_ESTABLISHMENT_FROM_CLIENT_COMMAND_ID)
#define ZCL_TERMINATE_KEY_ESTABLISHMENT_COMMAND_ID ZCL_TERMINATE_KEY_ESTABLISHMENT_FROM_CLIENT_COMMAND_ID
#else
#error "ZCL TerminateKeyEstablishment Command ID not defined"
#endif
#endif // ALLOW_KEY_ESTABLISHMENT
#else // !UC_BUILD
#ifdef EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT
#define SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_CLIENT_PRESENT
#endif
#ifdef EMBER_AF_PLUGIN_ZLL_COMMISSIONING_SERVER
#define SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_SERVER_PRESENT
#endif
#endif // UC_BUILD

//------------------------------------------------------------------------------
// Globals

// Global enable. Defaults to true. User can set to false if s/he wishes.
// Example: user will set to false for SE 1.2 Comms Hub (GBCS)
static bool gInterpanEnabled;

// Global timeout value in seconds
static uint16_t gMessageTimeout;

// MAC frame control
// Bits:
// | 0-2   |   3      |    4    |  5  |  6    |   7-9    | 10-11 |  12-13   | 14-15 |
// | Frame | Security |  Frame  | Ack | Intra | Reserved | Dest. | Reserved | Src   |
// | Type  | Enabled  | Pending | Req | PAN   |          | Addr. |          | Adrr. |
// |       |          |         |     |       |          | Mode  |          | Mode  |

// Frame Type
//   000       = Beacon
//   001       = Data
//   010       = Acknwoledgement
//   011       = MAC Command
//   100 - 111 = Reserved

// Addressing Mode
//   00 - PAN ID and address field are not present
//   01 - Reserved
//   10 - Address field contains a 16-bit short address
//   11 - Address field contains a 64-bit extended address

#ifdef EZSP_HOST
#define MAC_FRAME_TYPE_DATA           0x0001

#define MAC_FRAME_SOURCE_MODE_SHORT 0x8000
#define MAC_FRAME_SOURCE_MODE_LONG  0xC000

#define MAC_FRAME_DESTINATION_MODE_SHORT   0x0800
#define MAC_FRAME_DESTINATION_MODE_LONG    0x0C00
#endif
// The two possible incoming MAC frame controls.
// Using short source address is not allowed.
#define SHORT_DEST_FRAME_CONTROL (MAC_FRAME_TYPE_DATA                \
                                  | MAC_FRAME_DESTINATION_MODE_SHORT \
                                  | MAC_FRAME_SOURCE_MODE_LONG)
#define LONG_DEST_FRAME_CONTROL  (MAC_FRAME_TYPE_DATA               \
                                  | MAC_FRAME_DESTINATION_MODE_LONG \
                                  | MAC_FRAME_SOURCE_MODE_LONG)

#define MAC_ACK_REQUIRED              0x0020

#if defined(ALLOW_APS_ENCRYPTED_MESSAGES)
  #define APS_ENCRYPTION_ALLOWED 1
#else
  #define APS_ENCRYPTION_ALLOWED 0
#endif

#define PRIMARY_ENDPOINT   0
#define ALL_ENDPOINTS      1
#define SPECIFIED_ENDPOINT 2

#if defined(EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO)
  #if EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO == PRIMARY_ENDPOINT
    #define ENDPOINT emberAfPrimaryEndpoint()

  #elif EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO == ALL_ENDPOINTS
    #define ENDPOINT EMBER_BROADCAST_ENDPOINT

  #elif EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO == SPECIFIED_ENDPOINT
    #define ENDPOINT EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO_SPECIFIED_ENDPOINT_VALUE

  #else
    #error Unknown value for interpan plugin option: EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO
  #endif
#else
  #error Invalid Interpan plugin Config: EMBER_AF_PLUGIN_INTERPAN_DELIVER_TO not defined.
#endif

//------------------------------------------------------------------------------
// Forward Declarations

static bool isMessageAllowed(EmberAfInterpanHeader *headerData,
                             uint8_t messageLength,
                             uint8_t *messageContents);

#if ((defined(EMBER_AF_PRINT_ENABLE) && defined(EMBER_AF_PRINT_APP)) || (defined(UC_BUILD) && defined(SL_CATALOG_ZIGBEE_DEBUG_PRINT_PRESENT)))
static void printMessage(EmberAfInterpanHeader *headerData);
#else
  #define printMessage(x)
#endif

#if !defined(ALLOW_APS_ENCRYPTED_MESSAGES)
  #define handleApsSecurity(...) (EMBER_LIBRARY_NOT_PRESENT)
#endif

#if !defined EMBER_AF_PLUGIN_INTERPAN_CUSTOM_FILTER
  #define EMBER_AF_PLUGIN_INTERPAN_CUSTOM_FILTER
#endif

#if defined(ALLOW_FRAGMENTATION)
EmberStatus interpanFragmentationSendUnicast(EmberAfInterpanHeader* header, uint8_t* message, uint16_t messageLen);
bool isInterpanFragment(uint8_t* payload, uint8_t payloadLen);
EmberStatus interpanFragmentationSendIpmf(txFragmentedInterpanPacket* txPacket);
EmberStatus interpanFragmentationProcessIpmf(EmberAfInterpanHeader header, uint8_t *message, uint8_t messageLen);
void interpanFragmentationSendIpmfResponse(EmberAfInterpanHeader header, uint8_t fragNum, uint8_t responseStatus);
void interpanFragmentationProcessIpmfResponse(EmberAfInterpanHeader header, uint8_t* payload, uint8_t payloadLen);

static txFragmentedInterpanPacket txPackets[EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_OUTGOING_PACKETS];
static rxFragmentedInterpanPacket rxPackets[EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_INCOMING_PACKETS];
static txFragmentedInterpanPacket* getFreeTxPacketEntry(EmberEUI64 destinationEui);
static rxFragmentedInterpanPacket* getFreeRxPacketEntry(EmberEUI64 sourceEui);
static txFragmentedInterpanPacket* txPacketLookUp(EmberEUI64 destEui);
static rxFragmentedInterpanPacket* rxPacketLookUp(EmberEUI64 sourceEui);
static void freeTxPacketEntry(txFragmentedInterpanPacket *txPacket, EInterpanFragmentationStatus status);
static void freeRxPacketEntry(rxFragmentedInterpanPacket *rxPacket, EInterpanFragmentationStatus status);

#ifdef UC_BUILD
sl_zigbee_event_t emberAfPluginInterpanFragmentTransmitEvent;
sl_zigbee_event_t emberAfPluginInterpanFragmentReceiveEvent;
void emberAfPluginInterpanFragmentTransmitEventHandler(SLXU_UC_EVENT);
void emberAfPluginInterpanFragmentReceiveEventHandler(SLXU_UC_EVENT);
#endif // UC_BUILD

#endif // ALLOW_FRAGMENTATION

// These have to stay outside the ifdef interpan frag check because AppBuilder
// generates code that calls them, which cannot be ifdeffed
#ifndef UC_BUILD
EmberEventControl emberAfPluginInterpanFragmentTransmitEventControl;
EmberEventControl emberAfPluginInterpanFragmentReceiveEventControl;
void emberAfPluginInterpanFragmentTransmitEventHandler(EmberEventControl *control);
void emberAfPluginInterpanFragmentReceiveEventHandler(EmberEventControl *control);
#endif // UC_BUILD

#define IPMF_MSG_TIMEOUT_MS       60 * 1000

//------------------------------------------------------------------------------

