espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/interpan/interpan.c
// Inter-PAN messages are a security risk because they are typically not
// encrypted and yet we must accept them.  Therefore, we are very strict about
// what we allow.  Listed below are ZCL messages that are allowed, including
// the profile, cluster, direction, and command id.  Any inter-PAN messages not
// matching one of these are dropped.
// If inter-PAN fragments (IPMF) are received, a different set of checks is
// performed.
static const EmberAfAllowedInterPanMessage messages[] = {
  // A custom filter can be added using this #define.
  // It should contain one or more 'EmberAfAllowedInterPanMessage' const structs
  EMBER_AF_PLUGIN_INTERPAN_CUSTOM_FILTER

#if defined(ALLOW_REQUIRED_SMART_ENERGY_MESSAGES)

#ifdef ZCL_USING_PRICE_CLUSTER_SERVER
  {
    SE_PROFILE_ID,
    ZCL_PRICE_CLUSTER_ID,
    ZCL_GET_CURRENT_PRICE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_CLIENT_TO_SERVER,
  },
  {
    SE_PROFILE_ID,
    ZCL_PRICE_CLUSTER_ID,
    ZCL_GET_SCHEDULED_PRICES_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_CLIENT_TO_SERVER,
  },
#endif

#endif // ALLOW_REQUIRED_SMART_ENERGY_MESSAGES

#if defined(ALLOW_SMART_ENERGY_RESPONSE_MESSAGES)

#ifdef ZCL_USING_PRICE_CLUSTER_CLIENT
  {
    SE_PROFILE_ID,
    ZCL_PRICE_CLUSTER_ID,
    ZCL_PUBLISH_PRICE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_SERVER_TO_CLIENT,
  },
#endif
#ifdef ZCL_USING_MESSAGING_CLUSTER_CLIENT
  {
    SE_PROFILE_ID,
    ZCL_MESSAGING_CLUSTER_ID,
    ZCL_DISPLAY_MESSAGE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_SERVER_TO_CLIENT,
  },
  {
    SE_PROFILE_ID,
    ZCL_MESSAGING_CLUSTER_ID,
    ZCL_CANCEL_MESSAGE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_SERVER_TO_CLIENT,
  },
#endif

#endif // ALLOW_SMART_ENERGY_RESPONSE_MESSAGES

#if defined(ALLOW_KEY_ESTABLISHMENT)
  // Since client and server share the same command ID's,
  // we can get away with only listing the request messages.
  {
    SE_PROFILE_ID,
    ZCL_KEY_ESTABLISHMENT_CLUSTER_ID,
    ZCL_INITIATE_KEY_ESTABLISHMENT_REQUEST_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_BOTH,
  },
  {
    SE_PROFILE_ID,
    ZCL_KEY_ESTABLISHMENT_CLUSTER_ID,
    ZCL_EPHEMERAL_DATA_RESPONSE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_BOTH,
  },
  {
    SE_PROFILE_ID,
    ZCL_KEY_ESTABLISHMENT_CLUSTER_ID,
    ZCL_CONFIRM_KEY_DATA_RESPONSE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_BOTH,
  },
  {
    SE_PROFILE_ID,
    ZCL_KEY_ESTABLISHMENT_CLUSTER_ID,
    ZCL_TERMINATE_KEY_ESTABLISHMENT_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_BOTH,
  },
  {
    SE_PROFILE_ID,
    ZCL_KEY_ESTABLISHMENT_CLUSTER_ID,
    ZCL_DEFAULT_RESPONSE_COMMAND_ID,
    EMBER_AF_INTERPAN_DIRECTION_CLIENT_TO_SERVER,
  },
#endif // ALLOW_KEY_ESTABLISHMENT

  { 0xFFFF }, // terminator
};

//#define ENCRYPT_DEBUG

#if !defined(ENCRYPT_DEBUG)
  #define printData(...)
#endif

// Private ZLL API's
bool emAfPluginZllCommissioningClientInterpanPreMessageReceivedCallback(const EmberAfInterpanHeader *header,
                                                                        uint8_t msgLen,
                                                                        uint8_t *message);
bool emAfPluginZllCommissioningServerInterpanPreMessageReceivedCallback(const EmberAfInterpanHeader *header,
                                                                        uint8_t msgLen,
                                                                        uint8_t *message);

//------------------------------------------------------------------------------

#ifdef UC_BUILD
void interpanPluginInit(uint8_t init_level)
{
  switch (init_level) {
    case SL_ZIGBEE_INIT_LEVEL_EVENT:
    {
#if defined(ALLOW_FRAGMENTATION)
      sl_zigbee_event_init(&emberAfPluginInterpanFragmentTransmitEvent,
                           emberAfPluginInterpanFragmentTransmitEventHandler);
      sl_zigbee_event_init(&emberAfPluginInterpanFragmentReceiveEvent,
                           emberAfPluginInterpanFragmentReceiveEventHandler);
#endif // ALLOW_FRAGMENTATION
      break;
    }

    case SL_ZIGBEE_INIT_LEVEL_LOCAL_DATA:
    {
      gInterpanEnabled = true;
      gMessageTimeout  = IPMF_MSG_TIMEOUT_MS;

#if defined(ALLOW_FRAGMENTATION)
      uint8_t i;

      // The following two loops need adjustment if more than one packet is desired
      for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_OUTGOING_PACKETS; i++) {
        txPackets[i].messageType  = UNUSED_TX_PACKET_ENTRY;
        txPackets[i].event = &emberAfPluginInterpanFragmentTransmitEvent;
      }
      for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_INCOMING_PACKETS; i++) {
        MEMSET(rxPackets[i].sourceEui, 0, EUI64_SIZE);
        rxPackets[i].event = &emberAfPluginInterpanFragmentReceiveEvent;
      }
#endif //ALLOW_FRAGMENTATION
      break;
    }
  }
}
#else // !UC_BUILD
void interpanPluginInit(void)
{
  gInterpanEnabled = true;
  gMessageTimeout  = IPMF_MSG_TIMEOUT_MS;

#if defined(ALLOW_FRAGMENTATION)
  uint8_t i;

  // The following two loops need adjustment if more than one packet is desired
  for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_OUTGOING_PACKETS; i++) {
    txPackets[i].messageType  = UNUSED_TX_PACKET_ENTRY;
    txPackets[i].eventControl = &emberAfPluginInterpanFragmentTransmitEventControl;
  }
  for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_INCOMING_PACKETS; i++) {
    MEMSET(rxPackets[i].sourceEui, 0, EUI64_SIZE);
    rxPackets[i].eventControl = &emberAfPluginInterpanFragmentReceiveEventControl;
  }
#endif //ALLOW_FRAGMENTATION
}
#endif // UC_BUILD

// This function sets the global state of inter-PAN. If state is true, inter-PAN
// messages are sent and received, else, all inter-PANs are dropped.
void emAfPluginInterpanSetEnableState(bool enable)
{
  if (gInterpanEnabled != enable) {
    gInterpanEnabled = enable;
    interpanPluginSetMacMatchFilterEnable(enable);
  }
}

#if defined(ALLOW_FRAGMENTATION)
// This is a helper function for testing purposes only. It changes the inter-PAN
// fragment message timeout
void interpanPluginSetFragmentMessageTimeout(uint16_t timeout)  // seconds
{
  uint16_t timeoutMs = timeout * 1000;
  if (gMessageTimeout != timeoutMs) {
    gMessageTimeout = timeoutMs;
    emberAfAppPrintln("IPMF message timeout changed to %d seconds", timeout);
  }
}
#endif //ALLOW_FRAGMENTATION

#if defined(ENCRYPT_DEBUG)

static void printData(const char * name, uint8_t* message, uint8_t length)
{
  uint8_t i;
  emberAfAppPrint("\n%p: ", name);
  for (i = 0; i < length; i++) {
    emberAfAppPrint("%X ", message[i]);
    emberAfAppFlush();
  }
  emberAfAppPrintln("");
  emberAfAppFlush();
}

#endif

static uint8_t* pushInt16u(uint8_t *finger, uint16_t value)
{
  *finger++ = LOW_BYTE(value);
  *finger++ = HIGH_BYTE(value);
  return finger;
}

static uint8_t* pushEui64(uint8_t *finger, uint8_t *value)
{
  MEMMOVE(finger, value, 8);
  return finger + 8;
}

#if defined(ALLOW_APS_ENCRYPTED_MESSAGES)

