espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/interpan/interpan.c
    *messageLength = apsHeaderIndex + apsEncryptLength;
  }

  return (finger - message);
}

bool emAfPluginInterpanProcessMessage(uint8_t messageLength,
                                      uint8_t *messageContents)
{
  EmberApsFrame apsFrame;
  EmberIncomingMessageType type;
  bool loopback;
  EmberAfInterpanHeader headerData;
  uint8_t payloadOffset, payloadLength;
  uint8_t* payload;

  emberAfDebugPrintln("emAfPluginInterpanProcessMessage");
  payloadOffset = parseInterpanMessage(messageContents,
                                       &messageLength,
                                       &headerData);
  if (payloadOffset == 0) {
    return false;
  }
  printMessage(&headerData);

  payload = messageContents + payloadOffset;
  payloadLength = messageLength - payloadOffset;

  if (emberAfPluginInterpanPreMessageReceivedCallback(&headerData,
                                                      payloadLength,
                                                      payload)
#ifdef SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_CLIENT_PRESENT
      || emAfPluginZllCommissioningClientInterpanPreMessageReceivedCallback(&headerData,
                                                                            payloadLength,
                                                                            payload)
#endif // ZSL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_CLIENT_PRESENT
#ifdef SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_SERVER_PRESENT
      || emAfPluginZllCommissioningServerInterpanPreMessageReceivedCallback(&headerData,
                                                                            payloadLength,
                                                                            payload)
#endif // SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_SERVER_PRESENT
      ) {
    return true;
  }
#if defined(SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_CLIENT_PRESENT) || defined(SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_SERVER_PRESENT)
  else if (headerData.profileId == EMBER_ZLL_PROFILE_ID
           && headerData.clusterId == ZCL_ZLL_COMMISSIONING_CLUSTER_ID) {
    // Drop any other ZLL commissioning interpans, if they get this far.
    emberAfDebugPrintln("Interpan - dropping unhandled interpans");
    return true;
  }
#endif // SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_CLIENT_PRESENT || SL_CATALOG_ZIGBEE_ZLL_COMMISSIONING_SERVER_PRESENT

  if (!isMessageAllowed(&headerData, payloadLength, payload)) {
    return false;
  }

  if (headerData.options & EMBER_AF_INTERPAN_OPTION_MAC_HAS_LONG_ADDRESS) {
    headerData.shortAddress = EMBER_NULL_NODE_ID;
    loopback = emberIsLocalEui64(headerData.longAddress);
  } else {
    loopback = (emberAfGetNodeId() == headerData.shortAddress);
  }

  apsFrame.profileId = headerData.profileId;
  apsFrame.clusterId = headerData.clusterId;
  apsFrame.sourceEndpoint = 1;   // arbitrary since not sent over-the-air
  apsFrame.destinationEndpoint = ENDPOINT;
  apsFrame.options = (EMBER_APS_OPTION_NONE
                      | ((headerData.options
                          & EMBER_AF_INTERPAN_OPTION_APS_ENCRYPT)
                         ? EMBER_APS_OPTION_ENCRYPTION
                         : 0));
  apsFrame.groupId = headerData.groupId;
  apsFrame.sequence = 0x00; // unknown sequence number

  switch (headerData.messageType) {
    case EMBER_AF_INTER_PAN_UNICAST:
      type = EMBER_INCOMING_UNICAST;
      break;
    case EMBER_AF_INTER_PAN_BROADCAST:
      type = (loopback
              ? EMBER_INCOMING_BROADCAST_LOOPBACK
              : EMBER_INCOMING_BROADCAST);
      break;
    case EMBER_AF_INTER_PAN_MULTICAST:
      type = (loopback
              ? EMBER_INCOMING_MULTICAST_LOOPBACK
              : EMBER_INCOMING_MULTICAST);
      break;
    default:
      return false;
  }

#if defined(ALLOW_FRAGMENTATION)
  // If interpan fragment, intercept
  if (SE_PROFILE_ID == headerData.profileId) {
    if (isInterpanFragment(payload, payloadLength)) {
      uint8_t fragNum = payload[INTERPAN_FRAGMENTATION_APS_INDEX_IPMF_INDEX];

      switch (payload[INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_INDEX]) {
        case INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_IPMF_VAL:
        {
          EmberStatus status = interpanFragmentationProcessIpmf(headerData,
                                                                messageContents,
                                                                messageLength);
          interpanFragmentationSendIpmfResponse(headerData,
                                                fragNum,
                                                EMBER_SUCCESS == status
                                                ? INTERPAN_IPMF_RESPONSE_SUCCESS
                                                : INTERPAN_IPMF_RESPONSE_FAILURE);
        }
        break;
        case INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_IPMF_RESPONSE_VAL:
        {
          // This function will also send the next fragment if response is OK
          interpanFragmentationProcessIpmfResponse(headerData,
                                                   payload,
                                                   payloadLength);
        }
        break;
        default:
          break;
      }

      // All inter-PAN fragments are consumed
      return true;
    }
  }
#endif // ALLOW_FRAGMENTATION

  return emberAfProcessMessage(&apsFrame,
                               type,
                               payload,
                               payloadLength,
                               headerData.shortAddress,
                               &headerData);
}

static bool isMessageAllowed(EmberAfInterpanHeader *headerData,
                             uint8_t messageLength,
                             uint8_t *messageContents)
{
  uint8_t incomingMessageOptions = 0;
  uint8_t commandId;
  uint8_t i;

  if (messageLength < EMBER_AF_ZCL_OVERHEAD) {
    emberAfAppPrintln("%pmessage too short (%d < %d)!",
                      "ERR: Inter-PAN ",
                      messageLength,
                      EMBER_AF_ZCL_OVERHEAD);
    return false;
  }

