espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/interpan/interpan.c
  if (headerData->options & EMBER_AF_INTERPAN_OPTION_APS_ENCRYPT) {
    return APS_ENCRYPTION_ALLOWED;
  }

  // Only the first bit is used for ZCL Frame type
  if (messageContents[0] & BIT(1)) {
    emberAfAppPrintln("%pUnsupported ZCL frame type.",
                      "ERR: Inter-PAN ");
    return false;
  }

  if (messageContents[0] & ZCL_MANUFACTURER_SPECIFIC_MASK) {
    incomingMessageOptions |= EMBER_AF_INTERPAN_MANUFACTURER_SPECIFIC;
  }
  if ((messageContents[0] & ZCL_CLUSTER_SPECIFIC_COMMAND)
      == ZCL_GLOBAL_COMMAND) {
    incomingMessageOptions |= EMBER_AF_INTERPAN_GLOBAL_COMMAND;
  }

  incomingMessageOptions |= ((messageContents[0] & ZCL_FRAME_CONTROL_DIRECTION_MASK)
                             ? EMBER_AF_INTERPAN_DIRECTION_SERVER_TO_CLIENT
                             : EMBER_AF_INTERPAN_DIRECTION_CLIENT_TO_SERVER);
  if (messageContents[0] & ZCL_MANUFACTURER_SPECIFIC_MASK) {
    if (messageLength < EMBER_AF_ZCL_MANUFACTURER_SPECIFIC_OVERHEAD) {
      emberAfAppPrintln("%pmessage too short!", "ERR: Inter-PAN ");
      return false;
    }
    commandId = messageContents[4];
  } else {
    commandId = messageContents[2];
  }

#if defined (ALLOW_FRAGMENTATION)
  // If interpan fragmentation is enabled, we allow all messages of
  // SE profile ID, appropriate control byte value, and appropriate lengths
  if ((headerData->profileId == SE_PROFILE_ID)
      && isInterpanFragment(messageContents, messageLength)) {
    return true;
  }
#endif // ALLOW_FRAGMENTATION

  i = 0;
  while (messages[i].profileId != 0xFFFF) {
    if (messages[i].profileId == headerData->profileId
        && messages[i].clusterId == headerData->clusterId
        && messages[i].commandId == commandId
        // Here we only check if the direction is allowed
        && (messages[i].options & incomingMessageOptions)) {
      return true;
    }
    i++;
  }

  emberAfAppPrintln("%pprofile 0x%2x, cluster 0x%2x, command 0x%x not permitted",
                    "ERR: Inter-PAN ",
                    headerData->profileId,
                    headerData->clusterId,
                    commandId);
  return false;
}

#if ((defined(EMBER_AF_PRINT_ENABLE) && defined(EMBER_AF_PRINT_APP)) || (defined(UC_BUILD) && defined(SL_CATALOG_ZIGBEE_DEBUG_PRINT_PRESENT)))

static void printMessage(EmberAfInterpanHeader *headerData)
{
  emberAfAppPrint("RX inter-PAN message (");
  if (headerData->messageType == EMBER_AF_INTER_PAN_UNICAST) {
    emberAfAppPrint("uni");
  } else if (headerData->messageType == EMBER_AF_INTER_PAN_BROADCAST) {
    emberAfAppPrint("broad");
  } else if (headerData->messageType == EMBER_AF_INTER_PAN_MULTICAST) {
    emberAfAppPrint("multi");
  }
  emberAfAppPrintln("cast):");
  emberAfAppFlush();
  emberAfAppPrintln("  src pan id: 0x%2x", headerData->panId);
  if (headerData->options & EMBER_AF_INTERPAN_OPTION_MAC_HAS_LONG_ADDRESS) {
    emberAfAppPrint("  src long id: ");
    emberAfPrintBigEndianEui64(headerData->longAddress);
    emberAfAppPrintln("");
  } else {
    emberAfAppPrintln("  src short id: 0x%2x", headerData->shortAddress);
  }
  emberAfAppFlush();
  emberAfAppPrintln("  profile id: 0x%2x", headerData->profileId);
  emberAfAppPrint("  cluster id: 0x%2x ", headerData->clusterId);
  emberAfAppDebugExec(emberAfDecodeAndPrintClusterWithMfgCode(headerData->clusterId, emberAfGetMfgCodeFromCurrentCommand()));
  emberAfAppPrintln("");
  if (headerData->messageType == EMBER_AF_INTER_PAN_MULTICAST) {
    emberAfAppPrintln("  group id: 0x%2x", headerData->groupId);
  }
  emberAfAppFlush();
}

#endif //defined(EMBER_AF_PRINT_ENABLE) && defined(EMBER_AF_PRINT_APP)

EmberStatus emberAfInterpanSendMessageCallback(EmberAfInterpanHeader* header,
                                               uint16_t messageLength,
                                               uint8_t* messageBytes)
{
  EmberStatus status;
  uint8_t message[EMBER_AF_MAXIMUM_INTERPAN_LENGTH];
  uint16_t maxLen;
  uint8_t headerSize = EMBER_AF_INTER_PAN_UNICAST == header->messageType
                       ? INTERPAN_UNICAST_HEADER_SIZE
                       : INTERPAN_MULTICAST_HEADER_SIZE;

  if (!gInterpanEnabled) {
    return EMBER_INVALID_CALL;
  }

  if ((headerSize + messageLength) <= EMBER_AF_MAXIMUM_INTERPAN_LENGTH) {
    status = makeInterPanMessage(header,
                                 message,
                                 EMBER_AF_MAXIMUM_INTERPAN_LENGTH,
                                 messageBytes,
                                 &messageLength,
                                 &maxLen);
    if (status == EMBER_SUCCESS) {
      status = emAfPluginInterpanSendRawMessage((uint8_t)maxLen, message);
    }
  }
#if defined(ALLOW_FRAGMENTATION)
  else if ((headerSize + messageLength)
           <= EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_BUFFER_SIZE) {
    if (EMBER_AF_INTER_PAN_UNICAST != header->messageType) {
      return EMBER_INVALID_CALL;
    }

    status = interpanFragmentationSendUnicast(header,
                                              messageBytes,
                                              messageLength);
  }
#endif // ALLOW_FRAGMENTATION
  else {
    return EMBER_MESSAGE_TOO_LONG;
  }

  if (status != EMBER_SUCCESS) {
    return status;
  }

  emberAfAppPrint("T%4x:Inter-PAN TX (%d) [",
                  emberAfGetCurrentTime(),
                  messageLength);
  emberAfAppPrintBuffer(messageBytes, messageLength, true);
  emberAfAppPrintln("], 0x%x", status);
  emberAfAppFlush();

  return status;
}

#if defined(ALLOW_FRAGMENTATION)

// This function checks if packet is an inter-PAN fragment. It must do length
// checks as well since ZCL default responses come in with APS payload byte 1
// 0x00, which is also an inter-PAN IPMF control byte value.
bool isInterpanFragment(uint8_t* payload, uint8_t payloadLen)
{
  if (!payload || (payloadLen < EMBER_APS_INTERPAN_FRAGMENT_MIN_LEN)) {
    return false;
  }

  switch (payload[INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_INDEX]) {
    case INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_IPMF_VAL:
    {
      if ((payloadLen >= EMBER_APS_INTERPAN_FRAGMENTATION_OVERHEAD)
          && (payload[INTERPAN_FRAGMENTATION_APS_LEN_IPMF_INDEX]
              == (payloadLen - EMBER_APS_INTERPAN_FRAGMENTATION_OVERHEAD))) {
        return true;
      }
    }
    break;
    case INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_IPMF_RESPONSE_VAL:
    {
      if (EMBER_APS_INTERPAN_FRAGMENTATION_RESPONSE_LEN == payloadLen) {
        return true;
      }
    }
    break;
    default:
      break;
  }

