espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/interpan/interpan.c
  // Copy header info from pre-built packet
  MEMMOVE(finger, txPacket->buffer, headerLen);
  finger += headerLen;

  // Write the IPMF payload with a fragment of the whole message
  messageSentLen = txPacket->fragmentMaxLen * txPacket->fragmentNum;
  messageLeftLen = txPacket->bufLen - headerLen - messageSentLen;
  messageToBeSentLen =  messageLeftLen >= txPacket->fragmentMaxLen
                       ? txPacket->fragmentMaxLen : messageLeftLen;

  *finger++ = INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_IPMF_VAL;
  *finger++ = txPacket->fragmentNum;
  *finger++ = txPacket->numFragments;
  *finger++ = messageToBeSentLen;
  MEMMOVE(finger,
          (txPacket->buffer + headerLen + messageSentLen),
          messageToBeSentLen);
  finger += messageToBeSentLen;

  packetLen = finger - message;

  emberAfAppPrintln("Sending interpan fragment %d of %d",
                    txPacket->fragmentNum, txPacket->numFragments - 1);

  status = emAfPluginInterpanSendRawMessage(packetLen, message);

  // Start a timer waiting for the IPMF response
#ifdef UC_BUILD
  sl_zigbee_event_set_delay_ms(txPacket->event, gMessageTimeout);
#else
  emberEventControlSetDelayMS(*(txPacket->eventControl), gMessageTimeout);
#endif

  return status;
}

// This function reads an IPMF message and stores necessary data. The caller
// will need to send an IPMF response based on the return from this function.
EmberStatus interpanFragmentationProcessIpmf(EmberAfInterpanHeader header,
                                             uint8_t *message, uint8_t messageLen)
{
  uint8_t* finger;
  uint8_t fragNum, numFrags, fragLen, headerLen = INTERPAN_UNICAST_HEADER_SIZE;
  rxFragmentedInterpanPacket *rxPacket;

  if (!message || !messageLen) {
    return EMBER_BAD_ARGUMENT;
  }

  finger = message + headerLen;
  finger++;   // Skip the control byte
  fragNum  = *finger++;
  numFrags = *finger++;
  fragLen  = *finger++;

  emberAfAppPrintln("Receiving inter-PAN fragment %d of %d", fragNum, numFrags - 1);

  // See if we already have an entry for this fragment transmission
  rxPacket = rxPacketLookUp(header.longAddress);
  if (!rxPacket && (0 != fragNum)) {
    emberAfAppPrintln("ERR: expected first IPMF index 0, got %d", fragNum);
    return EMBER_INDEX_OUT_OF_RANGE;
  } else if (rxPacket && (0 == fragNum)) {
    emberAfAppPrint("ERR: ");
    emberAfPrintLittleEndianEui64(header.longAddress);
    emberAfAppPrintln(" sending multiple IPMF index 0 fragments");
    freeRxPacketEntry(rxPacket, IPMF_RX_BAD_RESPONSE);
    return EMBER_INDEX_OUT_OF_RANGE;
  }

  // If no entry, see if we have room to take a buffer
  if (NULL == rxPacket) {
    rxPacket = getFreeRxPacketEntry(header.longAddress);
    if (rxPacket) {
      // If we've allocated a new buffer, copy the header over and set data
      MEMMOVE(rxPacket->buffer, message, headerLen);
      rxPacket->bufLen                  = headerLen;
      rxPacket->numFragments            = numFrags;
      rxPacket->lastFragmentNumReceived = fragNum;
    }
  }

  if (NULL == rxPacket) {
    emberAfAppPrint("ERR: RX interpan fragment from ");
    emberAfPrintLittleEndianEui64(header.longAddress);
    emberAfAppPrintln(" but no available buffers");
    return EMBER_MAX_MESSAGE_LIMIT_REACHED;
  }

  // We received an IPMF, so turn off the timer for now
#ifdef UC_BUILD
  sl_zigbee_event_set_inactive(rxPacket->event);
#else
  emberEventControlSetInactive(*(rxPacket->eventControl));
#endif

  if (fragLen == 0) {
    emberAfAppPrintln("ERR: RX interpan fragment from ");
    emberAfPrintLittleEndianEui64(header.longAddress);
    emberAfAppPrintln(" with IPMF length 0");
    freeRxPacketEntry(rxPacket, IPMF_RX_BAD_RESPONSE);
    return EMBER_INDEX_OUT_OF_RANGE;
  }

  if (0 != fragNum) {
    if (rxPacket->lastFragmentNumReceived != (fragNum - 1)) {
      emberAfAppPrintln("ERR: RX IPMF fragment %d after %d, expecting %d",
                        fragNum, rxPacket->lastFragmentNumReceived,
                        rxPacket->lastFragmentNumReceived + 1);
      freeRxPacketEntry(rxPacket, IPMF_RX_BAD_RESPONSE);
      return EMBER_INDEX_OUT_OF_RANGE;
    }
    if (rxPacket->numFragments != numFrags) {
      emberAfAppPrintln("ERR: expecting total number of IPMFs %d, but received"
                        " %d in IPMF fragment %d",
                        rxPacket->numFragments, numFrags, fragNum);
      freeRxPacketEntry(rxPacket, IPMF_RX_BAD_RESPONSE);
      return EMBER_INDEX_OUT_OF_RANGE;
    }
    // Note that we allow sequential fragments to specify different lengths.
    // In theory, frags 0 to n-1 should be of the same maximum length, and the
    // last fragment n should be of shorter length. For now, we'll allow that
    // any of those middle packets may come in with a different length.
  }

  // Strip the payload and add it to the whole message buffer
  MEMMOVE(rxPacket->buffer + rxPacket->bufLen, finger, fragLen);
  rxPacket->bufLen += fragLen;
  rxPacket->lastFragmentNumReceived = fragNum;

  if (rxPacket->lastFragmentNumReceived == (rxPacket->numFragments - 1)) {
    // Full message received
    emberAfAppPrint("T%4x:Inter-PAN RX (%d B, %d fragments) [",
                    emberAfGetCurrentTime(),
                    rxPacket->bufLen - headerLen,
                    rxPacket->numFragments);
    emberAfAppPrintBuffer(rxPacket->buffer + headerLen,
                          rxPacket->bufLen - headerLen,
                          true);
    emberAfAppPrintln("], 0x%x", EMBER_SUCCESS);
    emberAfAppFlush();

    // User callback: all frags received, message reconstructed
    emberAfPluginInterpanMessageReceivedOverFragmentsCallback(
      &header,
      rxPacket->bufLen - headerLen,
      rxPacket->buffer + headerLen);

    freeRxPacketEntry(rxPacket, IPMF_SUCCESS);
  }

  return EMBER_SUCCESS;
}

// This function sends an IPMF response to the sender of the IPMF
void interpanFragmentationSendIpmfResponse(EmberAfInterpanHeader header,
                                           uint8_t fragNum, uint8_t response)
{
  EmberStatus status;
  uint8_t message[EMBER_AF_MAXIMUM_INTERPAN_LENGTH];
  uint8_t* finger;
  uint16_t messageLength, noPayloadLen = 0;
  uint8_t noPayload = 0;

  if ((INTERPAN_IPMF_RESPONSE_SUCCESS != response)
      && (INTERPAN_IPMF_RESPONSE_FAILURE != response)) {
    return;
  }

