espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/interpan/interpan.c
  // Construct a new IPMF message, but no payload
  status = makeInterPanMessage(&header,
                               message,
                               EMBER_AF_MAXIMUM_INTERPAN_LENGTH,
                               &noPayload,
                               &noPayloadLen,
                               &messageLength);
  if (EMBER_SUCCESS != status) {
    return;
  }

  // Move past the header and write the IPMF response payload
  finger = message + messageLength;
  *finger++ = INTERPAN_FRAGMENTATION_APS_CONTROL_BYTE_IPMF_RESPONSE_VAL;
  *finger++ = fragNum;
  *finger++ = response;

  messageLength += EMBER_APS_INTERPAN_FRAGMENTATION_RESPONSE_LEN;

  // Send the response
  emAfPluginInterpanSendRawMessage(messageLength, message);

  // Start a timer waiting for the next IPMF
  rxFragmentedInterpanPacket* rxPacket = rxPacketLookUp(header.longAddress);
  if (rxPacket) {
#ifdef UC_BUILD
    sl_zigbee_event_set_delay_ms(rxPacket->event, gMessageTimeout);
#else
    emberEventControlSetDelayMS(*(rxPacket->eventControl), gMessageTimeout);
#endif
  }
}

// This function processes the IPMF response and either sends the next fragment
// or finishes the transmission
void interpanFragmentationProcessIpmfResponse(EmberAfInterpanHeader header,
                                              uint8_t* payload,
                                              uint8_t payloadLen)
{
  if (!payload
      || (EMBER_APS_INTERPAN_FRAGMENTATION_RESPONSE_LEN != payloadLen)) {
    return;
  }

  uint8_t fragmentNumAcked = payload[INTERPAN_FRAGMENTATION_APS_INDEX_IPMF_INDEX];
  uint8_t response = payload[INTERPAN_FRAGMENTATION_APS_IPMF_RESPONSE_INDEX];

  txFragmentedInterpanPacket* txPacket = txPacketLookUp(header.longAddress);
  if (!txPacket) {
    return;
  }

  // We received an IPMF, so turn off the timer for now
#ifdef UC_BUILD
  sl_zigbee_event_set_inactive(txPacket->event);
#else
  emberEventControlSetInactive(*(txPacket->eventControl));
#endif

  if (fragmentNumAcked != txPacket->fragmentNum) {
    // Partner is not acking what we've sent it - error
    freeTxPacketEntry(txPacket, IPMF_TX_BAD_RESPONSE);
    return;
  }

  if (INTERPAN_IPMF_RESPONSE_SUCCESS != response) {
    // Partner acking bad response - error
    freeTxPacketEntry(txPacket, IPMF_TX_BAD_RESPONSE);
    return;
  }

  if (txPacket->fragmentNum == (txPacket->numFragments - 1)) {
    // Done!
    freeTxPacketEntry(txPacket, IPMF_SUCCESS);
    return;
  }

  txPacket->fragmentNum++;
  interpanFragmentationSendIpmf(txPacket);
}

#ifdef UC_BUILD
// This function is called when an inter-PAN fragment transmission fails to
// receive a response within the allotted time
void emberAfPluginInterpanFragmentTransmitEventHandler(SLXU_UC_EVENT)
{
  sl_zigbee_event_set_inactive(event);

  uint8_t i;
  for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_OUTGOING_PACKETS; i++) {
    txFragmentedInterpanPacket *txPacket = &(txPackets[i]);
    if (txPacket->event == event) {
      emberAfAppPrintln("ERR: TX inter-PAN: fragment %d of %d has timed out "
                        "waiting for a fragment response",
                        txPacket->fragmentNum, txPacket->numFragments - 1);
      freeTxPacketEntry(txPacket, IPMF_TX_TIMEOUT);
    }
  }
}

// This function is called when an inter-PAN fragment reception fails to receive
// the next fragment within the allotted time
void emberAfPluginInterpanFragmentReceiveEventHandler(SLXU_UC_EVENT)
{
  sl_zigbee_event_set_inactive(event);

  uint8_t i;
  for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_INCOMING_PACKETS; i++) {
    rxFragmentedInterpanPacket *rxPacket = &(rxPackets[i]);
    if (rxPacket->event == event) {
      emberAfAppPrintln("ERR: RX inter-PAN: fragment %d of %d has timed out "
                        "waiting for the next fragment",
                        rxPacket->lastFragmentNumReceived,
                        rxPacket->numFragments - 1);
      freeRxPacketEntry(rxPacket, IPMF_RX_TIMEOUT);
    }
  }
}
#endif // UC_BUILD

#endif // ALLOW_FRAGMENTATION

#ifndef UC_BUILD

// This function is called when an inter-PAN fragment transmission fails to
// receive a response within the allotted time
void emberAfPluginInterpanFragmentTransmitEventHandler(EmberEventControl *control)
{
  emberEventControlSetInactive(emberAfPluginInterpanFragmentReceiveEventControl);

#if defined(ALLOW_FRAGMENTATION)
  uint8_t i;
  for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_OUTGOING_PACKETS; i++) {
    txFragmentedInterpanPacket *txPacket = &(txPackets[i]);
    if (txPacket->eventControl == control) {
      emberAfAppPrintln("ERR: TX inter-PAN: fragment %d of %d has timed out "
                        "waiting for a fragment response",
                        txPacket->fragmentNum, txPacket->numFragments - 1);
      freeTxPacketEntry(txPacket, IPMF_TX_TIMEOUT);
    }
  }
#endif // ALLOW_FRAGMENTATION
}

// This function is called when an inter-PAN fragment reception fails to receive
// the next fragment within the allotted time
void emberAfPluginInterpanFragmentReceiveEventHandler(EmberEventControl *control)
{
  emberEventControlSetInactive(*control);

#if defined(ALLOW_FRAGMENTATION)
  uint8_t i;
  for (i = 0; i < EMBER_AF_PLUGIN_INTERPAN_FRAGMENTATION_MAX_INCOMING_PACKETS; i++) {
    rxFragmentedInterpanPacket *rxPacket = &(rxPackets[i]);
    if (rxPacket->eventControl == control) {
      emberAfAppPrintln("ERR: RX inter-PAN: fragment %d of %d has timed out "
                        "waiting for the next fragment",
                        rxPacket->lastFragmentNumReceived,
                        rxPacket->numFragments - 1);
      freeRxPacketEntry(rxPacket, IPMF_RX_TIMEOUT);
    }
  }
#endif // ALLOW_FRAGMENTATION
}

#endif // UC_BUILD

//------------------------------------------------------------------------------
// Weak callback definitions.

WEAK(bool emberAfPluginInterpanPreMessageReceivedCallback(const EmberAfInterpanHeader *header,
                                                          uint8_t msgLen,
                                                          uint8_t *message))
{
  return false;
}
